import type { CustomCellProps } from '@grid-table/view'

export function Column({ text }: CustomCellProps) {
  return <>{text}xx</>
}
// React.ComponentType<CustomCellProps<Record<string, any>>> | undefined
export const doubleData = {
  data: [
    {
      品牌: '黄河啤酒',
      同比: 0.11,
      年份: '2023',
      同期收入: 54418,
      公司: '太古可口可乐(中国)有限公司',
      开始日期: '2023-08-11T00:00:00',
      事业部: '宝翼制罐',
      是否达成: true,
      增长: -5329,
      备注: 'A',
      环比: -0.0215,
      上期收入: null,
      月份1: 1,
      结束日期: '2023-08-03T00:00:00',
      产品: '普通500铝555',
      本期收入: 0,
      月份: '一月',
      年龄: '33',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '青岛啤酒',
      同比: 0.33,
      年份: '2023',
      同期收入: 50264,
      公司: '青岛啤酒(徐州)彭城有限公司',
      开始日期: '2023-07-07T00:00:00',
      事业部: '兰州制罐',
      是否达成: true,
      增长: -2332.444,
      备注: 'A',
      环比: -0.33,
      上期收入: 80000899999999,
      月份1: 2,
      结束日期: '2023-12-30T05:06:06',
      产品: '330铝555',
      本期收入: 23566,
      月份: '二月',
      年龄: '66',
      是否达到预测: '未达到预测销售额',
    },
    {
      品牌: '百威啤酒',
      同比: 0.28,
      年份: '2022',
      同期收入: 65048,
      公司: '无锡市苏南五彩农业科技发展有限公司',
      开始日期: '2023-08-11T00:00:00',
      事业部: '安徽制罐',
      是否达成: true,
      增长: -2060,
      备注: 'A',
      环比: 0.11,
      上期收入: 44444,
      月份1: 3,
      结束日期: '2023-01-06T14:05:05',
      产品: '普通330铝',
      本期收入: 64456,
      月份: '三月',
      年龄: '33',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '黄河啤酒',
      同比: 0.27,
      年份: '2023',
      同期收入: 43062,
      公司: '太古可口可乐(中国)有限公司',
      开始日期: '2022-05-01T02:00:00',
      事业部: '两片罐事业部',
      是否达成: false,
      增长: 3073,
      备注: 'B',
      环比: 0.22,
      上期收入: 33333,
      月份1: 4,
      结束日期: '2023-08-11T13:00:00',
      产品: '普通330铝',
      本期收入: 33333,
      月份: '四月',
      年龄: '55',
      是否达到预测: '未达到预测销售额',
    },
    {
      品牌: '千岛湖啤酒1',
      同比: 0.3,
      年份: '2023',
      同期收入: 43062,
      公司: '青岛啤酒(徐州)彭城有限公司',
      开始日期: '2023-08-03T20:06:04',
      事业部: '河北制罐',
      是否达成: true,
      增长: -5281,
      备注: 'B',
      环比: 0.45,
      上期收入: 33333,
      月份1: 5,
      结束日期: '2023-08-12T00:00:00',
      产品: '普通330铝',
      本期收入: 33333,
      月份: '五月',
      年龄: '26',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '百威啤酒',
      同比: 0.33,
      年份: '2022',
      同期收入: 82342,
      公司: '无锡市苏南五彩农业科技发展有限公司',
      开始日期: '2023-07-07T00:00:00',
      事业部: '成都制罐',
      是否达成: false,
      增长: 6105,
      备注: 'D',
      环比: 0.66,
      上期收入: 33333,
      月份1: 6,
      结束日期: '2023-08-13T00:00:00',
      产品: '普通500铝555',
      本期收入: -23333,
      月份: '六月',
      年龄: '31',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '千岛湖啤酒1',
      同比: 0.39,
      年份: '2023',
      同期收入: 79286,
      公司: '无锡市苏南五彩农业科技发展有限公司',
      开始日期: '2023-07-07T10:11:05',
      事业部: '佛山制罐',
      是否达成: true,
      增长: -4954,
      备注: 'C',
      环比: 0.77,
      上期收入: 79286,
      月份1: 7,
      结束日期: '2023-08-14T00:00:00',
      产品: '普通500铝555',
      本期收入: 51231,
      月份: '七月',
      年龄: '44',
      是否达到预测: '未达到预测销售额',
    },
    {
      品牌: '千岛湖啤酒1',
      同比: 0.25,
      年份: '2023',
      同期收入: 43473,
      公司: '太古可口可乐(中国)有限公司',
      开始日期: '2023-07-07T03:00:00',
      事业部: '武汉制罐',
      是否达成: false,
      增长: 0,
      备注: 'C',
      环比: 0.35,
      上期收入: 43473,
      月份1: 8,
      结束日期: '2023-06-08T00:00:00',
      产品: '330铝555',
      本期收入: null,
      月份: '八月',
      年龄: '35',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '雪花啤酒',
      同比: 0.15,
      年份: '2023',
      同期收入: 56775,
      公司: '太古可口可乐(中国)有限公司',
      开始日期: '2023-07-07T00:00:00',
      事业部: '河南制罐',
      是否达成: true,
      增长: -5937.2334,
      备注: 'D',
      环比: 0.46,
      上期收入: 56775,
      月份1: 9,
      结束日期: '2023-07-07T00:00:00',
      产品: '普通330铝',
      本期收入: -8233,
      月份: '九月',
      年龄: '64',
      是否达到预测: '未达到预测销售额',
    },
    {
      品牌: '青岛啤酒',
      同比: 0.34,
      年份: '2023',
      同期收入: 100058,
      公司: '青岛啤酒(徐州)彭城有限公司',
      开始日期: '2023-08-03T00:00:00',
      事业部: '哈尔滨制罐',
      是否达成: false,
      增长: 0.55,
      备注: 'C',
      环比: 0.25,
      上期收入: 100058,
      月份1: 10,
      结束日期: '2023-08-03T23:59:59',
      产品: '普通500铝555',
      本期收入: 82345,
      月份: '十月',
      年龄: '23',
      是否达到预测: '未达到预测销售额',
    },
    {
      品牌: '雪花啤酒',
      同比: 0.18,
      年份: '2022',
      同期收入: 43062,
      公司: '青岛啤酒(徐州)彭城有限公司',
      开始日期: '2023-08-03T00:00:00',
      事业部: '沧州制罐',
      是否达成: true,
      增长: -5340,
      备注: 'D',
      环比: 0.0215,
      上期收入: 101200,
      月份1: 11,
      结束日期: '2023-06-23T00:00:00',
      产品: '330铝555',
      本期收入: 25144,
      月份: '十一月',
      年龄: '49',
      是否达到预测: '达到预测销售额',
    },
    {
      品牌: '雪花啤酒',
      同比: 0.41,
      年份: '2022',
      同期收入: 43062,
      公司: '无锡市苏南五彩农业科技发展有限公司',
      开始日期: '2023-01-01T03:03:00',
      事业部: '北京制罐',
      是否达成: false,
      增长: null,
      备注: 'B',
      环比: 0.21,
      上期收入: 72355,
      月份1: 12,
      结束日期: '2023-08-10T00:00:00',
      产品: '普通500铝555',
      本期收入: 41235,
      月份: '十二月',
      年龄: '51',
      是否达到预测: '未达到预测销售额',
    },
  ],
  fields: {
    rows: ['月份', '事业部'],
    columns: ['产品', '品牌'],
    values: ['上期收入', '同比'],
  },

  meta: [
    {
      field: '上期收入',
      name: '上期收入',
      renderComponent: Column,
    },
    {
      field: '同比',
      name: '同比',
      // formatter: function () {
      //   const format = '无'
      //   const precision = 1
      //   const unitDisplay = { content: 'dd后缀啊啊啊啊啊啊啊啊' }
      //   const unitValue = 1
      //   function div(arg1, arg2) {
      //     if (!arg1) return arg1
      //     let t1 = 0
      //     let t2 = 0
      //     const sign = arg1 < 0 ? '-' : ''
      //     arg1 = Math.abs(arg1)
      //     try {
      //       t1 = arg1.toString().split('.')[1].length
      //     } catch (e) {}
      //     try {
      //       t2 = arg2.toString().split('.')[1].length
      //     } catch (e) {}
      //     const x = arg1.toString().replace('.', '')
      //     let diff = t2 - t1
      //     if (diff === 0) return t1 > 0 ? Number(sign + x) : Number(sign + arg1 / arg2)
      //     if (diff > 0) return Number(sign + x + '0'.repeat(diff))
      //     diff = Math.abs(diff)
      //     if (arg2 > 1) diff += arg2.toString().length - 1
      //     if (diff > x.length) return Number(sign + '0.' + '0'.repeat(diff - x.length) + x)
      //     return Number(sign + x.slice(0, x.length - diff) + '.' + x.slice(x.length - diff))
      //   }
      //   return function (item) {
      //     if (typeof item !== 'number') return item

      //     let uv = unitValue
      //     if (format === '百分比') uv /= 100

      //     let val = div(item, uv)
      //     val = isNaN(val) ? 0 : val

      //     if (precision !== undefined) {
      //       val = val
      //         .toLocaleString('en-US', {
      //           minimumFractionDigits: precision,
      //           maximumFractionDigits: precision,
      //         })
      //         .replace(/,/g, '')
      //     } else {
      //       val = '' + val
      //     }

      //     if (format === '千分位') {
      //       const parts = val.split('.')
      //       parts[0] = parts[0].replace(new RegExp('(\\d)(?=(\\d{3})+(?!\\d))', 'g'), '$1,')
      //       val = parts.join('.')
      //     }

      //     if (format === '百分比') val += '%'

      //     if (unitDisplay) {
      //       const { position, content } = unitDisplay
      //       if (position === 'prefix') {
      //         val = content + ' ' + val
      //       } else {
      //         val = val + ' ' + content
      //       }
      //     }

      //     return val
      //   }
      // },
    },
  ],
  treeRow: {
    relation: {
      ROOT: ['60020236'],
      '60020236': ['60020590'],
      // ROOT: ['60020902', '60020905', '60050621', '60020590'],
      // '60020905': ['60050621'],
      // '60050621': ['60020593'],
      // '60020590': ['60050579', '60050624', '60020853', '60020236', '60020901', '60050625'],
    },
    propId: 'eff_his_org',
  },

  objectInfos: [
    {
      objectKey: 'BusinessObject',
      fields: [
        {
          name: 'eff_his_org',
          type: 'str',
          fields: null,
        },
        {
          name: '__desc_eff_his_org',
          type: 'str',
          fields: null,
        },
        {
          name: '财年',
          type: 'str',
          fields: null,
        },
        {
          name: '月',
          type: 'str',
          fields: null,
        },
        {
          name: 'compensation_item',
          type: 'str',
          fields: null,
        },
        {
          name: '__desc_compensation_item',
          type: 'str',
          fields: null,
        },
        {
          name: 'sum_of_amount',
          type: 'float',
          fields: null,
        },
      ],
    },
  ],
  description: {
    compensation_item: {
      AS001: '基本工资',
      AS020: '年终奖金',
      AS031: '社保基数',
      AS005: '节日费',
      AS002: '车贴',
      AS003: '津贴',
    },
    eff_his_org: {
      '60020905': '办公室员工招聘（2）',
      '60050621': 'CPC & CIC 集团（2）',
      '60020593': '劳动关系管理（2）',
      '60020590': 'BC招聘（3）',
      '60050579': '管理团队 (CIC & BJ)（2）',
      '60050624': '贝丝 & 男士美容仪器集团（1）',
      '60020853': '管理团队（上海）（7）',
      '60020236': '人才发展部门（5）',
      '60020901': '薪酬和福利运营（5）',
      '60050625': '员工敬业度部门（2）',
      '60020902': 'C&B卓越中心（4）',
    },
  },
  metadata: {
    globalVariables: [],
    variableInfos: {
      budget_plan_code: '"review"',
      org_code: '"60020113"',
    },
    recordName: '薪酬结果按组织汇总',
    recordCode: 'QUERY4',
  },
}
